In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error,mean_absolute_error,r2_score
from sklearn.linear_model import LogisticRegression
from sklearn import metrics
from sklearn import preprocessing

In [2]:
df=pd.read_csv("https://raw.githubusercontent.com/Premalatha-success/Supervised-Learning/main/titanic-training-data.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
def remove_outlier(col):
    sorted(col)
    Q1,Q3=col.quantile([0.25,0.75])
    IQR=Q3-Q1
    lower_range=Q1-(1.5*IQR)
    upper_range=Q3+(1.5*IQR)
    return lower_range,upper_range

In [4]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [5]:
lowlotfrontage,upplotfrontage=remove_outlier(df['PassengerId'])
df["PassengerId"]=np.where(df['PassengerId']>upplotfrontage,upplotfrontage,df['PassengerId'])
df["PassengerId"]=np.where(df['PassengerId']<lowlotfrontage,lowlotfrontage,df['PassengerId'])

In [6]:
lowlotfrontage,upplotfrontage=remove_outlier(df['Survived'])
df["Survived"]=np.where(df['Survived']>upplotfrontage,upplotfrontage,df['Survived'])
df["Survived"]=np.where(df['Survived']<lowlotfrontage,lowlotfrontage,df['Survived'])

In [7]:
lowlotfrontage,upplotfrontage=remove_outlier(df['Age'])
df["Age"]=np.where(df['Age']>upplotfrontage,upplotfrontage,df['Age'])
df["Age"]=np.where(df['Age']<lowlotfrontage,lowlotfrontage,df['Age'])

In [8]:
lowlotfrontage,upplotfrontage=remove_outlier(df['Pclass'])
df["Pclass"]=np.where(df['Pclass']>upplotfrontage,upplotfrontage,df['Pclass'])
df["Pclass"]=np.where(df['Pclass']<lowlotfrontage,lowlotfrontage,df['Pclass'])

In [9]:
lowlotfrontage,upplotfrontage=remove_outlier(df['SibSp'])
df["SibSp"]=np.where(df['SibSp']>upplotfrontage,upplotfrontage,df['SibSp'])
df["SibSp"]=np.where(df['SibSp']<lowlotfrontage,lowlotfrontage,df['SibSp'])

In [10]:
lowlotfrontage,upplotfrontage=remove_outlier(df['Parch'])
df["Parch"]=np.where(df['Parch']>upplotfrontage,upplotfrontage,df['Parch'])
df["Parch"]=np.where(df['Parch']<lowlotfrontage,lowlotfrontage,df['Parch'])

In [11]:
lowlotfrontage,upplotfrontage=remove_outlier(df['Fare'])
df["Fare"]=np.where(df['Fare']>upplotfrontage,upplotfrontage,df['Fare'])
df["Fare"]=np.where(df['Parch']<lowlotfrontage,lowlotfrontage,df['Fare'])

In [12]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [13]:
df.dropna(inplace=True)

In [14]:
dummies=pd.get_dummies(df[['Pclass','Sex','Embarked']],
                       columns=['Pclass','Sex','Embarked'],
                       drop_first=True)
df=pd.concat([df,dummies],axis=1)

In [15]:
columns=['Pclass','Sex','Embarked']
df.drop(columns,axis=1,inplace=True)

In [16]:
df.drop(['Cabin','PassengerId','Name','Ticket','Fare'],axis=1,inplace=True)

In [17]:
duplicate=df.duplicated()
print(duplicate.sum())
df[duplicate]

25

,Survived,Age,SibSp,Parch,Pclass_2.0,Pclass_3.0,Sex_male,Embarked_Q,Embarked_S
96,0.0,64.8125,0.0,0.0,0,0,1,0,0
124,0.0,54.0000,0.0,0.0,0,0,1,0,1
139,0.0,24.0000,0.0,0.0,0,0,1,0,0
230,1.0,35.0000,1.0,0.0,0,0,0,0,1
268,1.0,58.0000,0.0,0.0,0,0,0,0,1
369,1.0,24.0000,0.0,0.0,0,0,0,0,0
430,1.0,28.0000,0.0,0.0,0,0,1,0,1
462,0.0,47.0000,0.0,0.0,0,0,1,0,1
484,1.0,25.0000,1.0,0.0,0,0,1,0,0
486,1.0,35.0000,1.0,0.0,0,0,0,0,1
515,0.0,47.0000,0.0,0.0,0,0,1,0,1
520,1.0,30.0000,0.0,0.0,0,0,0,0,1
523,1.0,44.0000,0.0,0.0,0,0,0,0,0
536,0.0,45.0000,0.0,0.0,0,0,1,0,1
572,1.0,36.0000,0.0,0.0,0,0,1,0,1
577,1.0,39.0000,1.0,0.0,0,0,0,0,1
599,1.0,49.0000,1.0,0.0,0,0,1,0,0
625,0.0,61.0000,0.0,0.0,0,0,1,0,1
641,1.0,24.0000,0.0,0.0,0,0,0,0,0
659,0.0,58.0000,0.0,0.0,0,0,1,0,0
662,0.0,47.0000,0.0,0.0,0,0,1,0,1
710,1.0,24.0000,0.0,0.0,0,0,0,0,0
835,1.0,39.0000,1.0,0.0,0,0,0,0,0
853,1.0,16.0000,0.0,0.0,0,0,0,0,1
887,1.0,19.0000,0.0,0.0,0,0,0,0,1

In [18]:
df.drop_duplicates(inplace=True)
dpl=df.duplicated()
dpl.sum()

0

In [19]:
x=df.drop(['Survived'],axis=1)
y=df[['Survived']]

In [20]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.30,random_state=42)

In [21]:
reg=LogisticRegression()
reg.fit(x_train,y_train)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

LogisticRegression()

In [22]:
reg.score(x_train,y_train)

0.7727272727272727

In [23]:
reg.score(x_test,y_test)

0.75

In [24]:
from sklearn.metrics import mean_squared_error,mean_absolute_error
y_pred=reg.predict(x_test)

In [25]:
print(mean_absolute_error(y_test,y_pred))

0.25

In [26]:
print(mean_squared_error(y_test,y_pred))

0.25

In [27]:
from math import sqrt
print(sqrt(mean_squared_error(y_test,y_pred)))

0.5

In [28]:
from sklearn.metrics import r2_score
R_square=r2_score(y_test,y_pred)
print(R_square)

-0.21008403361344552

In [29]:
df2=pd.read_csv("https://raw.githubusercontent.com/Premalatha-success/Supervised-Learning/main/titanic-training-data.csv")
df2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [30]:
def remove_outlier(col):
    sorted(col)
    Q1,Q3=col.quantile([0.25,0.75])
    IQR=Q3-Q1
    lower_range=Q1-(1.5*IQR)
    upper_range=Q3+(1.5*IQR)
    return lower_range,upper_range

In [31]:
lowlotfrontage,upplotfrontage=remove_outlier(df2['PassengerId'])
df2["PassengerId"]=np.where(df2['PassengerId']>upplotfrontage,upplotfrontage,df2['PassengerId'])
df2["PassengerId"]=np.where(df2['PassengerId']<lowlotfrontage,lowlotfrontage,df2['PassengerId'])

In [32]:
lowlotfrontage,upplotfrontage=remove_outlier(df2['Survived'])
df2["Survived"]=np.where(df2['Survived']>upplotfrontage,upplotfrontage,df2['Survived'])
df2["Survived"]=np.where(df2['Survived']<lowlotfrontage,lowlotfrontage,df2['Survived'])

In [33]:
lowlotfrontage,upplotfrontage=remove_outlier(df2['Age'])
df2["Age"]=np.where(df2['Age']>upplotfrontage,upplotfrontage,df2['Age'])
df2["Age"]=np.where(df2['Age']<lowlotfrontage,lowlotfrontage,df2['Age'])

In [34]:
lowlotfrontage,upplotfrontage=remove_outlier(df2['Pclass'])
df2["Pclass"]=np.where(df2['Pclass']>upplotfrontage,upplotfrontage,df2['Pclass'])
df2["Pclass"]=np.where(df2['Pclass']<lowlotfrontage,lowlotfrontage,df2['Pclass'])

In [35]:
lowlotfrontage,upplotfrontage=remove_outlier(df2['SibSp'])
df2["SibSp"]=np.where(df2['SibSp']>upplotfrontage,upplotfrontage,df2['SibSp'])
df2["SibSp"]=np.where(df2['SibSp']<lowlotfrontage,lowlotfrontage,df2['SibSp'])

In [36]:
lowlotfrontage,upplotfrontage=remove_outlier(df2['Parch'])
df2["Parch"]=np.where(df2['Parch']>upplotfrontage,upplotfrontage,df2['Parch'])
df2["Parch"]=np.where(df2['Parch']<lowlotfrontage,lowlotfrontage,df2['Parch'])

In [37]:
lowlotfrontage,upplotfrontage=remove_outlier(df2['Fare'])
df2["Fare"]=np.where(df2['Fare']>upplotfrontage,upplotfrontage,df2['Fare'])
df2["Fare"]=np.where(df2['Parch']<lowlotfrontage,lowlotfrontage,df2['Fare'])

In [38]:
df2.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [39]:
df2["Age"]=df2["Age"].replace(to_replace="0",value=np.nan)
df2["Age"]=df2["Age"].astype(float)
median=df2["Age"].median()
median
df2["Age"].replace(np.nan,median,inplace=True)

In [40]:
dummies=pd.get_dummies(df2[['Pclass','Sex','Embarked']],
                       columns=['Pclass','Sex','Embarked'],
                       drop_first=True)
df2=pd.concat([df2,dummies],axis=1)

In [41]:
columns=['Pclass','Sex','Embarked']
df2.drop(columns,axis=1,inplace=True)

In [42]:
df2.drop(['Cabin','PassengerId','Name','Ticket','Fare'],axis=1,inplace=True)

In [43]:
duplicate=df2.duplicated()
print(duplicate.sum())
df2[duplicate]

357

,Survived,Age,SibSp,Parch,Pclass_2.0,Pclass_3.0,Sex_male,Embarked_Q,Embarked_S
32,1.0,28.0,0.0,0.0,0,1,0,1,0
42,0.0,28.0,0.0,0.0,0,1,1,0,0
45,0.0,28.0,0.0,0.0,0,1,1,0,1
47,1.0,28.0,0.0,0.0,0,1,0,1,0
51,0.0,21.0,0.0,0.0,0,1,1,0,1
...,...,...,...,...,...,...,...,...,...
883,0.0,28.0,0.0,0.0,1,0,1,0,1
884,0.0,25.0,0.0,0.0,0,1,1,0,1
886,0.0,27.0,0.0,0.0,1,0,1,0,1
887,1.0,19.0,0.0,0.0,0,0,0,0,1
888,0.0,28.0,1.0,0.0,0,1,0,0,1

In [44]:
df2.drop_duplicates(inplace=True)
dpl=df2.duplicated()
dpl.sum()

0

In [45]:
x=df2.drop(['Survived'],axis=1)
y=df2[['Survived']]

In [46]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.30,random_state=42)

In [47]:
reg=LogisticRegression()
reg.fit(x_train,y_train)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

LogisticRegression()

In [48]:
reg.score(x_train,y_train)

0.7506702412868632

In [49]:
reg.score(x_test,y_test)

0.7204968944099379

In [70]:
df3=pd.read_csv("https://raw.githubusercontent.com/Premalatha-success/Supervised-Learning/main/titanic-training-data.csv")
df3.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [71]:
def remove_outlier(col):
    sorted(col)
    Q1,Q3=col.quantile([0.25,0.75])
    IQR=Q3-Q1
    lower_range=Q1-(1.5*IQR)
    upper_range=Q3+(1.5*IQR)
    return lower_range,upper_range

In [72]:
lowlotfrontage,upplotfrontage=remove_outlier(df3['PassengerId'])
df3["PassengerId"]=np.where(df3['PassengerId']>upplotfrontage,upplotfrontage,df3['PassengerId'])
df3["PassengerId"]=np.where(df3['PassengerId']<lowlotfrontage,lowlotfrontage,df3['PassengerId'])

In [73]:
lowlotfrontage,upplotfrontage=remove_outlier(df3['Age'])
df3["Age"]=np.where(df3['Age']>upplotfrontage,upplotfrontage,df3['Age'])
df3["Age"]=np.where(df3['Age']<lowlotfrontage,lowlotfrontage,df3['Age'])

In [74]:
lowlotfrontage,upplotfrontage=remove_outlier(df3['Pclass'])
df3["Pclass"]=np.where(df3['Pclass']>upplotfrontage,upplotfrontage,df3['Pclass'])
df3["Pclass"]=np.where(df3['Pclass']<lowlotfrontage,lowlotfrontage,df3['Pclass'])

In [75]:
lowlotfrontage,upplotfrontage=remove_outlier(df3['SibSp'])
df3["SibSp"]=np.where(df3['SibSp']>upplotfrontage,upplotfrontage,df3['SibSp'])
df3["SibSp"]=np.where(df3['SibSp']<lowlotfrontage,lowlotfrontage,df3['SibSp'])

In [76]:
lowlotfrontage,upplotfrontage=remove_outlier(df3['Parch'])
df3["Parch"]=np.where(df3['Parch']>upplotfrontage,upplotfrontage,df3['Parch'])
df3["Parch"]=np.where(df3['Parch']<lowlotfrontage,lowlotfrontage,df3['Parch'])

In [77]:
lowlotfrontage,upplotfrontage=remove_outlier(df3['Fare'])
df3["Fare"]=np.where(df3['Fare']>upplotfrontage,upplotfrontage,df3['Fare'])
df3["Fare"]=np.where(df3['Parch']<lowlotfrontage,lowlotfrontage,df3['Fare'])

In [78]:
df3.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [79]:
df3["Age"]=df2["Age"].replace(to_replace="0",value=np.nan)
df3["Age"]=df2["Age"].astype(float)
mean=df3["Age"].mean()
mean
df3["Age"].replace(np.nan,median,inplace=True)

In [80]:
dummies=pd.get_dummies(df3[['Pclass','Sex','Embarked']],
                       columns=['Pclass','Sex','Embarked'],
                       drop_first=True)
df3=pd.concat([df3,dummies],axis=1)

In [81]:
columns=['Pclass','Sex','Embarked']
df3.drop(columns,axis=1,inplace=True)

In [82]:
df3.drop(['Cabin','PassengerId','Name','Ticket','Fare'],axis=1,inplace=True)

In [83]:
duplicate=df3.duplicated()
print(duplicate.sum())
df3[duplicate]

351

,Survived,Age,SibSp,Parch,Pclass_2.0,Pclass_3.0,Sex_male,Embarked_Q,Embarked_S
32,1,28.0,0.0,0.0,0,1,0,1,0
42,0,28.0,0.0,0.0,0,1,1,0,0
45,0,28.0,0.0,0.0,0,1,1,0,1
47,1,28.0,0.0,0.0,0,1,0,1,0
51,0,28.0,0.0,0.0,0,1,1,0,1
...,...,...,...,...,...,...,...,...,...
883,0,28.0,0.0,0.0,1,0,1,0,1
884,0,28.0,0.0,0.0,0,1,1,0,1
886,0,28.0,0.0,0.0,1,0,1,0,1
887,1,28.0,0.0,0.0,0,0,0,0,1
888,0,28.0,1.0,0.0,0,1,0,0,1

In [84]:
df3.drop_duplicates(inplace=True)
dpl=df3.duplicated()
dpl.sum()

0

In [85]:
x=df3.drop(['Survived'],axis=1)
y=df3[['Survived']]

In [86]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.30,random_state=42)

In [87]:
reg=LogisticRegression()
reg.fit(x_train,y_train)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

LogisticRegression()

In [88]:
reg.score(x_train,y_train)

0.7275132275132276

In [89]:
reg.score(x_test,y_test)

0.7839506172839507